Revit 2027 API
Rectangle(Int32, Int32, Int32, Int32) Constructor
 Creates an Rectangle instance with the specified four integers that represent the left, top, right and bottom of a rectangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rectangle(
	int left,
	int top,
	int right,
	int bottom
)
Public Sub New (
	left As Integer,
	top As Integer,
	right As Integer,
	bottom As Integer
)
public:
Rectangle(
	int left,
	int top,
	int right,
	int bottom
)
new :
        left : int *
        top : int *
        right : int *
        bottom : int -> Rectangle
Parameters
left Int32
 The x-coordinate of the top-left corner.
top Int32
 The y-coordinate of the top-left corner.
right Int32
 The x-coordinate of the bottom-right corner.
bottom Int32
 The y-coordinate of the bottom-right corner.
See Also
Reference
Rectangle Class
Rectangle Overload
Autodesk.Revit.DB Namespace